<!-- add-pr-comment:eks_plan -->

# staging/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_log_metric_filter.malware-scan-timeout[0] must be replaced
  # (moved from aws_cloudwatch_log_metric_filter.scanfiles-timeout[0])
-/+ resource "aws_cloudwatch_log_metric_filter" "malware-scan-timeout" {
      ~ apply_on_transformed_logs = false -> (known after apply)
      ~ id                        = "scanfiles-timeout" -> (known after apply)
      ~ name                      = "scanfiles-timeout" -> "malware-scan-timeout" # forces replacement
        # (3 unchanged attributes hidden)
      ~ metric_transformation {
          - dimensions    = {} -> null
          ~ name          = "scanfiles-timeout" -> "malware-scan-timeout"
            # (4 unchanged attributes hidden)
        }
    }
  # aws_cloudwatch_metric_alarm.logs-1-malware-scan-timeout-1-minute-warning[0] must be replaced
  # (moved from aws_cloudwatch_metric_alarm.logs-1-scanfiles-timeout-1-minute-warning[0])
-/+ resource "aws_cloudwatch_metric_alarm" "logs-1-malware-scan-timeout-1-minute-warning" {
      ~ alarm_description                     = "One scanfiles timeout detected error in 1 minute" -> "One malware scan timeout detected error in 1 minute"
      ~ alarm_name                            = "logs-1-scanfiles-timeout-5-minutes-warning" -> "logs-1-malware-scan-timeout-1-minute-warning" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ca-central-1:239043911459:alarm:logs-1-scanfiles-timeout-5-minutes-warning" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "logs-1-scanfiles-timeout-5-minutes-warning" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      ~ metric_name                           = "scanfiles-timeout" -> "malware-scan-timeout"
      - ok_actions                            = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (13 unchanged attributes hidden)
    }
Plan: 2 to add, 0 to change, 2 to destroy.

# --- End of Plan 1 ---